batisteo.vscode-django
cschlosser.doxdocgen
davidanson.vscode-markdownlint
docker.docker
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
dtoplak.vscode-glsllint
dustypomerleau.rust-syntax
eamodio.gitlens
ecmel.vscode-html-css
fill-labs.dependi
github.copilot
github.copilot-chat
github.vscode-github-actions
gordonsmith.observable-js
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mohsen1.prettify-json
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.theme-predawnkit
msjsdiag.vscode-react-native
njpwerner.autodocstring
oracle.oracle-java
quantum.qsharp-lang-vscode
redhat.java
ritwickdey.liveserver
rust-lang.rust-analyzer
slevesque.shader
tomoki1207.pdf
twxs.cmake
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wholroyd.jinja
yy0931.vscode-sqlite3-editor
